In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as  plt

In [3]:
dataset = pd.read_csv("MLTest.csv")
dataset.head(5)

,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year,species
0,Biscoe,47.8,15.0,215.0,5650.0,male,2007,NaN
1,Dream,40.2,17.1,193.0,3400.0,female,2009,NaN
2,Dream,36.0,17.8,195.0,3450.0,female,2009,NaN
3,Biscoe,49.8,15.9,229.0,5950.0,male,2009,NaN
4,Biscoe,38.6,17.2,199.0,3750.0,female,2009,NaN

In [4]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 343 entries, 0 to 342
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   island             343 non-null    object
 1   bill_length_mm     342 non-null    float64
 2   bill_depth_mm      342 non-null    float64
 3   flipper_length_mm  342 non-null    float64
 4   body_mass_g        342 non-null    float64
 5   sex                333 non-null    object
 6   year               343 non-null    int64
 7   species            314 non-null    object
dtypes: float64(4), int64(1), object(3)
memory usage: 21.6+ KB